Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/leaving_prison.html.txt.tmx
Source language: en
Languages: ga

source: The needs of those leaving prison vary considerably
ga: Bíonn éagsúlacht mhór maidir le riachtanais daoine a fhágann príosún

source: If you have served a short sentence, you may be able to resume your pre-prison life without any great difficulty
ga: Má chuir tú pionós gairid isteach, b’fhéidir go mbeidh tú in ann tosú arís ar do shaol réamh-phríosúin gan mórán deacrachta

source: If you have served a long sentence however, you may need considerable help to re-integrate into society
ga: Má chuir tú pionós fada isteach áfach, b’fhéidir go mbeidh cúnamh suntasach de dhíth ort chun athimeascadh sa tsochaí

source: Your crime and your time in prison may mean that you have lost your job
ga: B’fhéidir gur chaill tú do phost mar gheall ar do choir agus do sheal i bpríosún

source: Family relationships may be damaged or changed and you may have to start a new life
ga: B’fhéidir go ndearnadh damáiste do chaidrimh teaghlaigh nó gur athraíodh iad agus b’fhéidir go mbeidh ort tús a chur le saol nua

source: You may also be subject to various restrictions due to your criminal background
ga: Is féidir freisin go mbeidh tú faoi réir ag srianta éagsúla mar gheall ar do chúlra coiriúil

source: This document provides an overview of the services and supports available in Ireland to help you
ga: Soláthraíonn an doiciméad seo forléargas ar na seirbhísí agus tacaíochtaí atá ar fáil in Éirinn le cuidiú leat

source: Both before you leave prison and following your release you may be able to get advice from the Probation Service
ga: Féadfar go mbeidh tú in ann comhairle a fháil ón tSeirbhís Promhaidh sula bhfágfaidh tú príosún agus tar éis do scaoilte

source: The service funds a range of community based projects which may be able to assist you return to education, training or employment
ga: Maoiníonn an tseirbhís raon de thionscadail phobalbhunaithe a bheadh in ann cuidiú leat filleadh ar an oideachas, oiliúint nó fhostaíocht

source: Your first requirement after leaving prison may be finding somewhere to live
ga: Féadfar go mbeidh sé mar chéad riachtanas duit tar éis duit an príosún a fhágáil áit éigin le bheith i do chónaí a fháil

source: You may be able to return to your family home or you may need to look for new housing options
ga: Féadfar go mbeidh tú in ann filleadh ar do bhaile teaghlaigh nó b’fhéidir go mbeidh ort roghanna tithíochta nua a chuardach

source: If you live in rented accommodation you may get Rent Supplement
ga: Má chónaíonn tú i gcóiríocht ar cíos féadfar go bhfaighidh tú Forlíonadh Cíosa

source: There are various services available for people who are homeless, for example you may apply for local authority housing
ga: Tá seirbhísí éagsúla ar fáil do dhaoine atá gan dídean, mar shampla is féidir leat iarratas a dhéanamh ar thithíocht údaráis áitiúil

source: If you are under 18 years, you should register with the social worker in your Local Health Office
ga: Má tá tú faoi 18 mbliana d’aois, ba chóir duit clárú leis an oibrí sóisialta i do Ionad Sláinte Áitiúil

source: If you have been convicted of certain sex offences you may be subject to restrictions after you leave prison
ga: Má chiontaíodh tú i gcionta gnéis áirithe féadfar go mbeidh tú faoi réir ag srianta tar éis duit príosún a fhágáil

source: For example, you may be required to provide information about where you are living and where you intend to travel
ga: Mar shampla, féadfar go n-iarrfar ort faisnéis a sholáthar faoin áit ina gcónaíonn tú agus faoi do phleananna taistil

source: This is generally known as being on the sex offenders register
ga: De ghnáth tagraítear dó seo mar a bheith ar chlár na gciontóirí gnéis

source: You may also have to tell certain prospective employers that you are a sex offender
ga: Féadfar go mbeidh ort a chur in iúl d’fhostóirí áirithe gur ciontóir gnéis tú

source: If you are unemployed, you may get help in finding a job from the Department of Social Protection
ga: Má tá tú dífhostaithe, féadfar go bhfaighidh tú cúnamh maidir le post a fháil ó an Roinn Coimirce Sóisialaí

source: You may need to get a Personal Public Service Number if you do not already have one
ga: Féadfar go mbeidh ort Uimhir Phearsanta Seirbhíse Poiblí a fháil mura bhfuil ceann agat cheana féin

source: Education and Training Boards provide training services
ga: Soláthraíonn Boird Oideachais agus Oiliúna seirbhísí oiliúna

source: You may qualify for a social welfare payment if you are unemployed or unable to work
ga: Féadfar go mbeidh tú incháilithe íocaíocht leasa shóisialaigh a fháil má tá tú dífhostaithe nó mura bhfuil tú in ann obair a dhéanamh

source: You should go to your local social welfare office for further information
ga: Ba chóir duit dul chuig d’oifig leasa shóisialaigh áitiúil chun tuilleadh eolais a fháil

source: Social welfare payments that may be available to you include Jobseeker's Allowance (formerly Unemployment Assistance), Disability Allowance or Supplementary Welfare Allowance
ga: Is iad na hÍocaíochtaí leasa shóisialaigh a d’fhéadfadh a bheith ar fáil duit ná Liúntas Cuardaitheora Poist (Cúnamh Dífhostaíochta roimhe seo), Liúntas Míchumais nó Liúntas Leasa Forlíontach

source: The Supplementary Welfare Allowance scheme may also help you with certain once off or urgent costs - for example, if you need help to get furniture
ga: Féadfar go mbeidh an scéim um Liúntas Leasa Forlíontach in ann cuidiú leat le costais aonuaire nó phráinneacha - mar shampla, má bhíonn cúnamh de dhíth ort troscán a fháil

source: Depending on the number of social insurance contributions you have and the length of time you spent in prison, you may qualify for Jobseeker's Benefit or Illness Benefit
ga: Ag brath ar líon na ranníocaíochtaí árachais shóisialaigh atá íoctha agat agus fad na tréimhse a chaith tú i bpríosún, féadfar go mbeidh tú incháilithe Sochar Cuardaitheora Poist nó Sochar Breoiteachta a fháil

source: If you have problems managing your money, you should contact the Money Advice and Budgeting Service (MABS)
ga: Má tá fadhbanna agat maidir le do chuid airgid a bhainistiú, ba chóir duit teagmháil a dhéanamh leis an tSeirbhís um Chomhairle Airgid agus Buiséadú (MABS)

source: Depending on your income and circumstances following release, you may be eligible for either a medical card or a GP visit card
ga: Ag brath ar d’ioncam agus do chúinsí tar éis do scaoilte, féadfar go mbeidh tú incháilithe cárta leighis nó cárta cuairte dochtúra

source: Application forms for a medical card or GP Visit Card are available online or from your Local Health Office
ga: Tá foirmeacha iarratais ar chárta leighis nó ar chárta cuairte dochtúra ar fáil ar líne nó ó d’Oifig Sláinte Áitiúil

source: Staff in your nearest health centre or Local Health Office can help you fill out the forms and answer any other questions
ga: Is féidir leis an bhfoireann i d’Ionad Sláinte nó Oifig Sláinte Áitiúil is gaire duit cuidiú leat na foirmeacha a líonadh agus aon cheisteanna eile a fhreagairt

source: Unless you have a medical card or GP Visit card, visits to your GP are not free
ga: Mura bhfuil cárta leighis nó cárta cuairte dochtúra agat, níl cuairteanna chuig do dhochtúir ginearálta saor in aisce

source: People with medical cards are entitled to prescribed drugs and medicines, subject to a charge per item prescribed
ga: Mura bhfuil cárta leighis agat, tá tú i dteideal cógais agus leigheasanna ordaithe a fháil, faoi réir táille in aghaidh na míre oidis

source: Otherwise you are entitled to subsidised prescribed drugs and medicines under the Drugs Payment Scheme
ga: Seachas sin, tá tú i dteideal cógais agus cógais ordaithe fóirdheontais faoin Scéim Íocaíochta Drugaí

source: People suffering from certain long-term illnesses are entitled to get the drugs and medicines for the treatment of that illness free of charge
ga: Tá daoine a bhfuil galair fhadtéarmacha áirithe orthu i dteideal cógais agus leigheasanna a fháil saor in aisce le haghaidh an ghalair sin a chóireáil

source: This is called the Long-Term Illness Scheme
ga: Tugtar an Scéim Tinneas Fadtéarmach air seo

source: You may wish to avail of various educational opportunities
ga: Féadfar go mbeidh fonn ort leas a bhaint as deiseanna oideachasúla éagsúla

source: You should contact your local Education and Training Board to find out what classes are available locally or contact specific educational institutions for information on adult education
ga: Ba chóir duit teagmháil a dhéanamh le do Bhord Oideachais agus Oiliúna áitiúil le fáil amach faoi ranganna atá ar fáil go háitiúil nó déan teagmháil le hinstitiúidí oideachais sainiúla chun faisnéis a fháil maidir le hoideachas aosach
